/*
rare:1,  [ンランスⅠ",  "攻撃184"], 
rare:1,  [ンランスⅠ",  "攻撃184"], 
rare:1,  [ンランスⅡ",  "攻撃207"], 
rare:1,  [ランスⅠ",  "攻撃207"], 
rare:1,  [ランスⅡ",  "攻撃230"], 
rare:2,  [ンランスⅢ",  "攻撃230"], 
rare:2,  [ランスⅠ",  "攻撃253",  "会心15％"], 
rare:2,  [ムランスⅠ",  "攻撃230",  "毒240"], 
rare:2,  [ランスⅢ",  "攻撃253"], 
rare:2,  [ロランスⅠ",  "攻撃253",  "防御10",  "会心−20％"], 
rare:2,  [ホーンⅠ",  "攻撃253",  "水150"], 
rare:3,  [ールランスⅠ",  "攻撃253"], 
rare:3,  [ランスⅡ",  "攻撃276",  "会心15％"], 
rare:3,  [ーランスⅠ",  "攻撃276",  "雷120"], 
rare:3,  [ムランスⅡ",  "攻撃253",  "毒300"], 
rare:3,  [ボーンランスⅠ",  "攻撃322"], 
rare:3,  [ランスⅠ",  "攻撃276"], 
rare:3,  [ロランスⅡ",  "攻撃276",  "防御10",  "会心−20％"], 
rare:3,  [ホーンⅡ",  "攻撃276",  "水180"], 
rare:3,  [Ⅰ",  "攻撃230",  "龍300"], 
rare:4,  []
rare:4,  []
rare:4,  []
rare:4,  []
rare:4,  []
rare:4,  []
rare:4,  []
rare:4,  []
rare:4,  []
rare:4,  []
rare:4,  []
rare:4,  []
rare:4,  []
rare:4,  []
rare:5,  []
rare:5,  []
rare:5,  []
rare:5,  []
rare:5,  []
rare:5,  []
rare:5,  []
rare:5,  []
rare:5,  []
rare:5,  []
rare:5,  []
rare:5,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []
rare:6,  []

rare:6,  []
rare:6,  []*/
//レア度　武器名　スロット　攻撃力　会心　属性値　龍封力 防御力
const weponData = [
	[//rare1
	], [//rare2
	], [//rare3
	], [//rare4
	], [//rare5
	], [//rare6
	], 
	[//rare7
		["ネルガルカルガ", "①ーー", "460", "0", "龍120", "大", "0", "", "", "", "", ""], 
		["ギエナハルバⅡ", "ーーー", "368", "0", "氷360", "ー", "0", "", "", "", "", ""], 
		["ガマルパイルⅡ", "②②ー", "391", "0", "爆破210", "ー", "0", "", "", "", "", ""], 
		["ブルーテイル", "①ーー", "414", "20", "火270", "ー", "0", "", "", "", "", ""], 
		["ハザクヴェヒター", "②ーー", "437", "0", "龍240", "中", "0", "", "", "", "", ""], 
		["ガロンダーラⅡ", "ーーー", "391", "30", "火（210）", "ー", "0", "", "", "", "", ""], 
		["雷槍【イカヅチ】", "ーーー", "345", "10", "雷480", "ー", "0", "", "", "", "", ""], 
		["鋼氷槍", "ーーー", "391", "10", "氷210", "ー", "0", "", "", "", "", ""], 
		["アトロシスタワー", "ーーー", "529", "−25", "龍210", "大", "0", "", "", "", "", ""], 
		["エンプレスランス", "ーーー", "414", "0", "爆破150", "ー", "0", "", "", "", "", ""], 
		["団旗槍【導きの星】", "ーーー", "437", "0", "麻痺180", "ー", "0", "", "", "", "", ""], 
	], [//rare8
		["亡滅の腕", "①ーー", "483", "0", "龍150", "大", "0", "", "", "", "", ""], 
		["ブループロミネンス", "①ーー", "437", "20", "火300", "ー", "0", "", "", "", "", ""], 
		["ラ・モールの哀愁", "②ーー", "460", "0", "龍270", "中", "0", "", "", "", "", ""], 
		["爆鱗槍バゼルミニアド", "ーーー", "460", "0", "爆破210", "ー", "0", "", "", "", "", ""], 
		["雷槍【タケミカヅチ】", "ーーー", "368", "10", "雷540", "ー", "0", "", "", "", "", ""], 
		["テリオス＝ダオラ", "②ーー", "414", "10", "氷240", "ー", "0", "", "", "", "", ""], 
		["ゼノ＝ザウータ", "③③ー", "381", "15", "龍180", "小", "0", "", "", "", "", ""], 
		["エルダーバベル",  "③ーー", "460", "0", "火（330）", "ー", "20", "", "", "", "", ""], 
		["エンプレスランス・炎姫", "②①ー", "414", "20", "爆破180", "ー", "0", "", "", "", "", ""], 
		["エンプレスランス・滅尽", "②②ー", "437", "0", "爆破150", "ー", "0", "", "", "", "", ""], 
		["エンプレスランス・冥灯", "③③ー", "414", "10", "爆破150", "ー", "0", "", "", "", "", ""], 
	]
];